add diagramas
